{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "actinic keratosis",
    "1": "acute bronchiolitis",
    "2": "acute bronchitis",
    "3": "acute bronchospasm",
    "4": "acute kidney injury",
    "5": "acute pancreatitis",
    "6": "acute sinusitis",
    "7": "acute stress reaction",
    "8": "allergy",
    "9": "angina",
    "10": "anxiety",
    "11": "appendicitis",
    "12": "arthritis of the hip",
    "13": "asthma",
    "14": "benign prostatic hyperplasia (bph)",
    "15": "blepharitis",
    "16": "brachial neuritis",
    "17": "bursitis",
    "18": "carpal tunnel syndrome",
    "19": "cholecystitis",
    "20": "complex regional pain syndrome",
    "21": "concussion",
    "22": "conjunctivitis",
    "23": "conjunctivitis due to allergy",
    "24": "contact dermatitis",
    "25": "cornea infection",
    "26": "cystitis",
    "27": "degenerative disc disease",
    "28": "dental caries",
    "29": "depression",
    "30": "developmental disability",
    "31": "diaper rash",
    "32": "diverticulitis",
    "33": "drug reaction",
    "34": "ear drum damage",
    "35": "eczema",
    "36": "esophagitis",
    "37": "eustachian tube dysfunction (ear disorder)",
    "38": "fracture of the rib",
    "39": "fungal infection of the hair",
    "40": "gastrointestinal hemorrhage",
    "41": "gout",
    "42": "gum disease",
    "43": "heart attack",
    "44": "herniated disk",
    "45": "hiatal hernia",
    "46": "hyperemesis gravidarum",
    "47": "hypertensive heart disease",
    "48": "hypoglycemia",
    "49": "idiopathic excessive menstruation",
    "50": "idiopathic irregular menstrual cycle",
    "51": "idiopathic painful menstruation",
    "52": "infectious gastroenteritis",
    "53": "injury to the arm",
    "54": "injury to the leg",
    "55": "injury to the trunk",
    "56": "iron deficiency anemia",
    "57": "ischemic heart disease",
    "58": "kidney stone",
    "59": "liver disease",
    "60": "macular degeneration",
    "61": "marijuana abuse",
    "62": "multiple sclerosis",
    "63": "neurosis",
    "64": "noninfectious gastroenteritis",
    "65": "nose disorder",
    "66": "obstructive sleep apnea (osa)",
    "67": "otitis externa (swimmer's ear)",
    "68": "pain after an operation",
    "69": "panic disorder",
    "70": "pelvic inflammatory disease",
    "71": "peripheral nerve disorder",
    "72": "personality disorder",
    "73": "pneumonia",
    "74": "problem during pregnancy",
    "75": "psoriasis",
    "76": "psychotic disorder",
    "77": "pulmonary embolism",
    "78": "pyelonephritis",
    "79": "pyogenic skin infection",
    "80": "rectal disorder",
    "81": "schizophrenia",
    "82": "seasonal allergies (hay fever)",
    "83": "sebaceous cyst",
    "84": "seborrheic dermatitis",
    "85": "seborrheic keratosis",
    "86": "sinus bradycardia",
    "87": "skin pigmentation disorder",
    "88": "skin polyp",
    "89": "spinal stenosis",
    "90": "spondylosis",
    "91": "spontaneous abortion",
    "92": "sprain or strain",
    "93": "strep throat",
    "94": "stye",
    "95": "temporary or benign blood in urine",
    "96": "urinary tract infection",
    "97": "vaginal cyst",
    "98": "vaginitis",
    "99": "vulvodynia"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "actinic keratosis": 0,
    "acute bronchiolitis": 1,
    "acute bronchitis": 2,
    "acute bronchospasm": 3,
    "acute kidney injury": 4,
    "acute pancreatitis": 5,
    "acute sinusitis": 6,
    "acute stress reaction": 7,
    "allergy": 8,
    "angina": 9,
    "anxiety": 10,
    "appendicitis": 11,
    "arthritis of the hip": 12,
    "asthma": 13,
    "benign prostatic hyperplasia (bph)": 14,
    "blepharitis": 15,
    "brachial neuritis": 16,
    "bursitis": 17,
    "carpal tunnel syndrome": 18,
    "cholecystitis": 19,
    "complex regional pain syndrome": 20,
    "concussion": 21,
    "conjunctivitis": 22,
    "conjunctivitis due to allergy": 23,
    "contact dermatitis": 24,
    "cornea infection": 25,
    "cystitis": 26,
    "degenerative disc disease": 27,
    "dental caries": 28,
    "depression": 29,
    "developmental disability": 30,
    "diaper rash": 31,
    "diverticulitis": 32,
    "drug reaction": 33,
    "ear drum damage": 34,
    "eczema": 35,
    "esophagitis": 36,
    "eustachian tube dysfunction (ear disorder)": 37,
    "fracture of the rib": 38,
    "fungal infection of the hair": 39,
    "gastrointestinal hemorrhage": 40,
    "gout": 41,
    "gum disease": 42,
    "heart attack": 43,
    "herniated disk": 44,
    "hiatal hernia": 45,
    "hyperemesis gravidarum": 46,
    "hypertensive heart disease": 47,
    "hypoglycemia": 48,
    "idiopathic excessive menstruation": 49,
    "idiopathic irregular menstrual cycle": 50,
    "idiopathic painful menstruation": 51,
    "infectious gastroenteritis": 52,
    "injury to the arm": 53,
    "injury to the leg": 54,
    "injury to the trunk": 55,
    "iron deficiency anemia": 56,
    "ischemic heart disease": 57,
    "kidney stone": 58,
    "liver disease": 59,
    "macular degeneration": 60,
    "marijuana abuse": 61,
    "multiple sclerosis": 62,
    "neurosis": 63,
    "noninfectious gastroenteritis": 64,
    "nose disorder": 65,
    "obstructive sleep apnea (osa)": 66,
    "otitis externa (swimmer's ear)": 67,
    "pain after an operation": 68,
    "panic disorder": 69,
    "pelvic inflammatory disease": 70,
    "peripheral nerve disorder": 71,
    "personality disorder": 72,
    "pneumonia": 73,
    "problem during pregnancy": 74,
    "psoriasis": 75,
    "psychotic disorder": 76,
    "pulmonary embolism": 77,
    "pyelonephritis": 78,
    "pyogenic skin infection": 79,
    "rectal disorder": 80,
    "schizophrenia": 81,
    "seasonal allergies (hay fever)": 82,
    "sebaceous cyst": 83,
    "seborrheic dermatitis": 84,
    "seborrheic keratosis": 85,
    "sinus bradycardia": 86,
    "skin pigmentation disorder": 87,
    "skin polyp": 88,
    "spinal stenosis": 89,
    "spondylosis": 90,
    "spontaneous abortion": 91,
    "sprain or strain": 92,
    "strep throat": 93,
    "stye": 94,
    "temporary or benign blood in urine": 95,
    "urinary tract infection": 96,
    "vaginal cyst": 97,
    "vaginitis": 98,
    "vulvodynia": 99
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
